In [1]:
import pandas as pd

In [2]:
twod_array = [[0,1,2], [3,4,5]]

In [3]:
pd.DataFrame(twod_array)

   0  1  2
0  0  1  2
1  3  4  5

In [4]:
dic_arr = {'a' : [1,2,3], 'b' : [4,5,6]}

In [5]:
pd.DataFrame(dic_arr)

   a  b
0  1  4
1  2  5
2  3  6

In [6]:
list_arr = {'a' : ['Tokyo','Kanagawa','Chiba'], 'b' : ['Saitama','Tochigi','Ibaraki']}

In [7]:
pd.DataFrame(list_arr)

          a        b
0     Tokyo  Saitama
1  Kanagawa  Tochigi
2     Chiba  Ibaraki

In [8]:
tup_arr = {'a' : (1,2,3), 'b' : (4,5,6)}

In [9]:
pd.DataFrame(tup_arr)

   a  b
0  1  4
1  2  5
2  3  6

In [10]:
mix_dic = {'a' : [1,2,3], 'b' : ['a','b','c'], 'c' : (4,5,6)}

In [11]:
pd.DataFrame(mix_dic)

   a  b  c
0  1  a  4
1  2  b  5
2  3  c  6

In [14]:
import numpy as np

In [15]:
numpy_array = np.array([[1.5, 0], [0, 3.0]])

In [16]:
pd.DataFrame(numpy_array)

     0    1
0  1.5  0.0
1  0.0  3.0

In [17]:
state = pd.Series(['Tokyo', 'Osaka', 'Aichi', 'Hiroshima', 'Fukuoka'])

In [18]:
population = pd.Series([13515, 8839, 7483, 2644, 5102])

In [19]:
num_household = pd.Series([6691, 3918, 3060, 1209, 2197])

In [20]:
statistic = pd.DataFrame({
    'state' : state,
    'population' : population,
    'num_household' : num_household
})

In [21]:
statistic

       state  population  num_household
0      Tokyo       13515           6691
1      Osaka        8839           3918
2      Aichi        7483           3060
3  Hiroshima        2644           1209
4    Fukuoka        5102           2197

In [24]:
statistic_dict = {
    'population' : {'Tokyo' : 13515, 'Osaka' : 8839, 'Aichi' : 7483, 'Hiroshima' : 2844, \
                   'Fukuoka' : 5102},
    'num_household' : {'Osaka' : 3918, 'Aichi' : 3060, 'Tokyo' : 6691, \
                      'Hiroshima' : 1209, 'Fukuoka' : 2197}
}

In [25]:
statistic_2 = pd.DataFrame(statistic_dict)

In [26]:
statistic_2

           population  num_household
Aichi            7483           3060
Fukuoka          5102           2197
Hiroshima        2844           1209
Osaka            8839           3918
Tokyo           13515           6691

In [27]:
pd.DataFrame([
    {'Tokyo' : 6691, 'Osaka' : 3918, 'Hiroshima' : 1209, 'Aichi' : 3060, \
     'Fukuoka' : 2197},
    {'Tokyo' : 13515, 'Osaka' : 8839, 'Hiroshima' : 2844, 'Aichi' : 7843, \
    'Fukuoka' : 5102}
], index = ['num_household', 'population'])

               Aichi  Fukuoka  Hiroshima  Osaka  Tokyo
num_household   3060     2197       1209   3918   6691
population      7843     5102       2844   8839  13515

In [29]:
pd.DataFrame([
    pd.Series([6691, 3918, 1209, 3060, 2197], 
              index = ['Tokyo', 'Osaka', 'Hiroshima', 'Aichi', 'Fukuoka']),
    pd.Series([13515, 8839, 2844, 7843, 5102], 
             index = ['Tokyo', 'Osaka', 'Hiroshima', 'Aichi', 'Fukuoka'])
], index = ['num_household', 'population'])

               Tokyo  Osaka  Hiroshima  Aichi  Fukuoka
num_household   6691   3918       1209   3060     2197
population     13515   8839       2844   7843     5102

In [30]:
pd.DataFrame([
    (6691, 3918, 1209, 3060, 2197),
    [13515, 8839, 2844, 7834, 5102]
], index = ['num_household', 'population'], \
columns = ['Tokyo', 'Osaka', 'Hiroshima', 'Aichi', 'Fukuoka'])

               Tokyo  Osaka  Hiroshima  Aichi  Fukuoka
num_household   6691   3918       1209   3060     2197
population     13515   8839       2844   7834     5102

In [31]:
statistic

       state  population  num_household
0      Tokyo       13515           6691
1      Osaka        8839           3918
2      Aichi        7483           3060
3  Hiroshima        2644           1209
4    Fukuoka        5102           2197

In [32]:
pd.DataFrame(statistic)

       state  population  num_household
0      Tokyo       13515           6691
1      Osaka        8839           3918
2      Aichi        7483           3060
3  Hiroshima        2644           1209
4    Fukuoka        5102           2197

In [33]:
df = pd.DataFrame({
    'a' : [1, 1, 0],
    'b' : [0, 1, 0]}, dtype = bool)

In [34]:
df

       a      b
0   True  False
1   True   True
2  False  False

In [35]:
df = pd.DataFrame({
    'a' : [1, 1, 0],
    'b' : [0, 1, 0]}, dtype = float)

In [36]:
df

     a    b
0  1.0  0.0
1  1.0  1.0
2  0.0  0.0

In [37]:
df_2 = pd.DataFrame(df, copy = False)

In [38]:
df_3 = pd.DataFrame(df, copy = True)

In [39]:
df['a'] == df['b']

0    False
1     True
2     True
dtype: bool

In [40]:
df['c'] = df['a'] == df['b']

In [41]:
df

     a    b      c
0  1.0  0.0  False
1  1.0  1.0   True
2  0.0  0.0   True

In [42]:
df_2

     a    b      c
0  1.0  0.0  False
1  1.0  1.0   True
2  0.0  0.0   True

In [43]:
df_3

     a    b
0  1.0  0.0
1  1.0  1.0
2  0.0  0.0

In [44]:
num_per_house = pd.Series(
{'Tokyo' : 1.99, 'Osaka' : 2.22, 'Aichi' : 2.41, 'Hiroshima' : 2.29})

In [45]:
statistic_2

           population  num_household
Aichi            7483           3060
Fukuoka          5102           2197
Hiroshima        2844           1209
Osaka            8839           3918
Tokyo           13515           6691

In [46]:
statistic_2['num_per_house'] = num_per_house

In [47]:
statistic_2

           population  num_household  num_per_house
Aichi            7483           3060           2.41
Fukuoka          5102           2197            NaN
Hiroshima        2844           1209           2.29
Osaka            8839           3918           2.22
Tokyo           13515           6691           1.99

In [53]:
series = pd.Series([0,0])

In [49]:
df = pd.DataFrame([[1,2,4], [3,8,9]], index = ['a', 'b'], columns = ['new', 'old', 'now'])

In [50]:
df

   new  old  now
a    1    2    4
b    3    8    9

In [54]:
df['predict'] = series

In [55]:
df

   new  old  now  predict
a    1    2    4      NaN
b    3    8    9      NaN

In [56]:
del df['predict']

In [57]:
df

   new  old  now
a    1    2    4
b    3    8    9

In [58]:
rand_int

NameError: name 'rand_int' is not defined

In [60]:
rand_int = pd.DataFrame([[0,3,6,2,4],[5,0,2,2,3],[6,6,3,8,8],[8,1,7,5,5]], \
                     index = ['a', 'b', 'c', 'd'], columns = ['A', 'B', 'C', 'D', 'E'])

In [61]:
rand_int

   A  B  C  D  E
a  0  3  6  2  4
b  5  0  2  2  3
c  6  6  3  8  8
d  8  1  7  5  5

In [62]:
rand_int.loc['a', 'B']

3

In [63]:
rand_int.iloc[0, 1]

3

In [64]:
rand_int['A']

a    0
b    5
c    6
d    8
Name: A, dtype: int64

In [65]:
rand_int.A

a    0
b    5
c    6
d    8
Name: A, dtype: int64

In [66]:
rand_int.loc[:, 'B']

a    3
b    0
c    6
d    1
Name: B, dtype: int64

In [67]:
rand_int[2:4]

   A  B  C  D  E
c  6  6  3  8  8
d  8  1  7  5  5

In [68]:
df

   new  old  now
a    1    2    4
b    3    8    9

In [69]:
df = pd.DataFrame([[1.0,0.0,'False'], [1.0,1.0,'True'], [0.0,0.0,'True']], \
                 index = [0,1,2], columns = ['a', 'b', 'c'])

In [70]:
df

     a    b      c
0  1.0  0.0  False
1  1.0  1.0   True
2  0.0  0.0   True

In [71]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [72]:
df.style

In [73]:
df.T

       0     1     2
a      1     1     0
b      0     1     0
c  False  True  True

In [74]:
df.at[(0,'b')]

0.0

In [75]:
df.axes

[Int64Index([0, 1, 2], dtype='int64'), Index(['a', 'b', 'c'], dtype='object')]

In [76]:
df.dtypes

a    float64
b    float64
c     object
dtype: object

In [77]:
df.iat[0,1]

0.0

In [78]:
df.iloc[0,:2]

a    1
b    0
Name: 0, dtype: object

In [79]:
df.iloc[0,:1]

a    1
Name: 0, dtype: object

In [80]:
df.loc[:, 'a']

0    1.0
1    1.0
2    0.0
Name: a, dtype: float64

In [81]:
df.loc[1, 'a']

1.0

In [82]:
df.values

array([[1.0, 0.0, 'False'],
       [1.0, 1.0, 'True'],
       [0.0, 0.0, 'True']], dtype=object)

In [83]:
a_values = [1, 2, 3, 4, 5]
b_values = np.random.rand(5)
c_values = ['apple', 'banana', 'strawberry', 'peach', 'orange']
my_dict = {'A' : a_values, 'B' : b_values, 'C' : c_values}

In [84]:
my_dict

{'A': [1, 2, 3, 4, 5],
 'B': array([0.45989952, 0.02752086, 0.72181888, 0.54612485, 0.27878233]),
 'C': ['apple', 'banana', 'strawberry', 'peach', 'orange']}

In [85]:
my_df = pd.DataFrame.from_dict(my_dict)

In [86]:
my_df

   A         B           C
0  1  0.459900       apple
1  2  0.027521      banana
2  3  0.721819  strawberry
3  4  0.546125       peach
4  5  0.278782      orange